import React from 'react'

export default function TermsOfService () {
  return (
    <div className="p-10">
      <h1>서비스 이용약관</h1>
      <br />
      <h2 className="font-bold">1. 약관</h2>
      <hr />
      <p>Lofi with Discord(이하 본사라고 한다.)에서 제공하는 모든 서비스, 웹사이트, 챗봇을 이용함의 따라 사용자는 <span className="bg-yellow-100">본 서비스 이용약관에 동의한 것으로 간주</span>합니다.</p>
      <p>만약 본 약관에 대하여 사용자가 동의를 거부할 경우 본사가 해당 사용자에 대한 서비스를 거부할 수 있습니다.</p>

      <br />

      <h2 className="font-bold">2. 사용 라이선스</h2>
      <hr />
      <p>사용자는 본사에서 제공하는 서비스를 사용함에 따라 본사의 오디오 스트림 사본을 임시적으로 내려받을 수 있는 권한을 제공받습니다.</p>
      <p>이 오디오 스트림 사본은 <span className="bg-yellow-100">본사에서 지정한 특정 플랫폼에서 청취의 목적으로만 사용</span>되어야 합니다.</p>
      <br />
      <p>사용이 금지되는 목적 목록:</p>
      <ul className="list-disc">
        <li>오디오 스트림을 녹음, 변조하기 위한 목적</li>
        <li>본사에서 지정한 특정 플랫폼, 챗봇 이외의 본사와 관련이 없는 타 플랫폼에서 사용하기 위한 목적</li>
        <li>본사와의 협의 없이 오디오 스트림을 영리적으로 사용하기 위한 목적</li>
      </ul>

      <br />

      <h2 className="font-bold">3. 사실 보증 부인</h2>
      <hr />
      <p>본사에서 제공하는 모든 정보는 &quot;있는 그대로&quot; 사용자에게 제공합니다.</p>
      <p>다만 본사는 본사의 서비스에서 <span className="bg-yellow-100">제공하는 정보가 100% 사실임을 보증하지 않습니다.</span></p>
      <p>또한 본사는 자료의 정확성이나 신뢰성에 대해 어떠한 언급도 하지 않습니다.</p>

      <br />

      <h2 className="font-bold">4. 손해에 대한 한계</h2>
      <hr />
      <p><span className="bg-yellow-300">본사는 본사의 서비스를 사용할 수 없을 때 사용자에게 발생하는 모든 손해에 대해 책임을 지지 않습니다.</span></p>
      <p>또한 본사의 내부, 외부적으로 인한 사유로 인해 <span className="bg-yellow-300">내부 정보가 손상되는 것에 대해 책임을 지지 않습니다.</span></p>
      <p>본사는 사용자에게 이러한 손상 가능성을 충분히 설명하였으나, 이러한 한계는 귀하에게 적용되지 않을 수 있습니다.</p>

      <br />

      <h2 className="font-bold">5. 자료에 대한 한계</h2>
      <hr />
      <p>본사의 서비스에서 제공하는 모든 정보는 기술적 오류, 인쇄 오류 또는 사진 오류가 포함될 수 있습니다.</p>
      <p>본사는 본사의 서비스에서 제공하는 <span className="bg-yellow-100">어떤 자료도 정확하거나 완전하거나 최신임을 보장하지 않습니다.</span></p>
      <p>본사의 서비스에서 제공하는 모든 정보는 예고 없이 언제든지 변경될 수 있습니다.</p>

      <br />

      <h2 className="font-bold">6. 외부 링크</h2>
      <hr />
      <p>본사는 본사의 서비스에 링크된 모든 사이트를 검토하지 않았으며 이러한 사이트의 내용에 대한 책임을 지지 않습니다.</p>
      <p><span className="bg-yellow-300">본사의 서비스에 링크가 있다고 해서 해당 사이트를 본사가 승인한 것은 아닙니다.</span></p>
      <p><span className="bg-yellow-300">링크된 사이트를 사용하는 것은 사용자의 책임입니다.</span></p>

      <br />

      <h2 className="font-bold">7. 취약점 제보</h2>
      <hr />
      <p>본사는 본사의 서비스의 대한 선한 목적의 취약점 공격을 허가합니다.</p>
      <p>보안 취약점 혹은 버그를 발견한 최초 발견자는 지체없이 본사에 신고하여야 합니다.</p>
      <p>취약점 발견자가 해당 취약점을 공개된 장소에 배포 혹은 상업적 목적으로 사용할 경우 본사는 법적 대응을 검토할 수 있습니다.</p>

      <br />

      <h2 className="font-bold">8. 약관 수정</h2>
      <hr />
      <p>본사는 이 약관을 사전 통지 없이 개정할 수 있습니다.</p>
      <p>본사의 서비스를 사용함으로써 귀하는 본 이용약관의 최신 버전을 준수하는데 동의하는 것 입니다.</p>

      <br />

      <h2 className="font-bold">9. 개인정보 보호</h2>
      <hr />
      <p>개인정보처리방침을 참고하십시오.</p>

      <br />

      <h2 className="font-bold">10. 법률</h2>
      <hr />
      <p>본사와 본사의 서비스는 대한민국 법령을 우선 준수합니다.</p>
    </div>
  )
}
